import pygame

from configuration import config as cfg

from game import (
    initial_screen,
    gameover_screen,
    playng_game,
)

pygame.init()

#название игры
pygame.display.set_caption("Леталки!")

initial_screen()

playng_game()

gameover_screen()

pygame.display.flip()

pygame.quit()

# 22.10 - Добавить звуки на выстрел и столкновение с метеоритом (корабль и метеорит) - найти звуки

# TODO:
# Идеи для улучшения игры от Игоря:
# 2. Двигать задний фон - имитацию движения - найти похожие изображения
# 3. Возможность на экране геймовера снова вернутся к стартовому окну, чтобы начать игру заново

# Идеи для улучшения игры от Софы:
# 2. эффект полета пуль и метеоритов

# Далекие планы - сохранение в файл

# TODO
# сделать пересчет границ спавна метеоритов и движения корабля (чтобы не заезжали на жизни и счет)

# для жизней, отдельный класс.. метеориты просто 3 и изображение
