import pygame

from configuration import config as cfg

from game import (
    initial_screen,
    gameover_screen,
    playng_game,
)

pygame.init()

#название игры
pygame.display.set_caption("Леталки!")

initial_screen()

playng_game()

gameover_screen()

pygame.display.flip()

pygame.quit()



# TODO:
# 3. Сделать автофокус при нажатии на кнопку "Играть"

# Идеи для улучшения игры от Игоря:
# 1. Добавить звуки на выстрел и столкновение с метеоритом (корабль и метеорит) - найти звуки
# 2. Двигать задний фон - имитацию движения - найти похожие изображения
# 3. Возможность на экране геймовера снова вернутся к стартовому окну, чтобы начать игру заново
# 4. изменить надписи в игре .. скок метеоритов и жизней в картинках

# Идеи для улучшения игры от Софы:
# 1. крутить метеориты
# 2. эффект полета пуль и метеоритов

# Далекие планы - сохранение в файл